app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.user_id = current_user.id
    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "This is an article"], ["user_id", 1], ["created_at", "2016-03-29 01:55:08.049310"], ["updated_at", "2016-03-29 01:55:08.049310"]]